api/app/controllers/usuario_controller.rb

  def cadastrar()
  	nome = params[:nome]
  	email = params[:email]
  	senha = params[:senha]
    mensagem = params[:mensagem]
  	email = email.upcase

    redirect_to '#/cadastrar'
    verifica_email = Usuario.where("email = '#{email}'")
  	if verifica_email.blank?
		  usuario = Usuario.new
	  	usuario.nome = nome
	  	usuario.email = email
	  	usuario.senha = senha
	  	usuario.save
---
SELECT  "tb_usuarios".* FROM "tb_usuarios" WHERE (email = 'DASDAS') ORDER BY "tb_usuarios"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "tb_usuarios" ("nome", "email", "senha") VALUES (?, ?, ?)  [["nome", "sdsa"], ["email", "dsa"], ["senha", "dsds"]]